<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#One-Hot-Encoding" data-toc-modified-id="One-Hot-Encoding-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>One Hot Encoding</a></span><ul class="toc-item"><li><span><a href="#normal-One-Hot-Encoding" data-toc-modified-id="normal-One-Hot-Encoding-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>normal One Hot Encoding</a></span></li><li><span><a href="#solution-to-variables-with-many-categories" data-toc-modified-id="solution-to-variables-with-many-categories-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>solution to variables with many categories</a></span></li></ul></li><li><span><a href="#Count-or-frequency-encoding" data-toc-modified-id="Count-or-frequency-encoding-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Count or frequency encoding</a></span><ul class="toc-item"><li><span><a href="#Count-or-frequency-encoding-exp1" data-toc-modified-id="Count-or-frequency-encoding-exp1-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Count or frequency encoding exp1</a></span></li><li><span><a href="#Count-or-frequency-encoding-exp2" data-toc-modified-id="Count-or-frequency-encoding-exp2-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Count or frequency encoding exp2</a></span><ul class="toc-item"><li><ul class="toc-item"><li><span><a href="#Advantages" data-toc-modified-id="Advantages-2.2.0.1"><span class="toc-item-num">2.2.0.1&nbsp;&nbsp;</span>Advantages</a></span></li><li><span><a href="#Disadvantages" data-toc-modified-id="Disadvantages-2.2.0.2"><span class="toc-item-num">2.2.0.2&nbsp;&nbsp;</span>Disadvantages</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Ordinal-numbering-encoding-or-Label-Encoding" data-toc-modified-id="Ordinal-numbering-encoding-or-Label-Encoding-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Ordinal numbering encoding or Label Encoding</a></span></li><li><span><a href="#Target-Guided-Ordinal-Encoding" data-toc-modified-id="Target-Guided-Ordinal-Encoding-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Target Guided Ordinal Encoding</a></span></li><li><span><a href="#Mean-Encoding" data-toc-modified-id="Mean-Encoding-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Mean Encoding</a></span></li><li><span><a href="#Probability-Ratio-Encoding" data-toc-modified-id="Probability-Ratio-Encoding-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Probability Ratio Encoding</a></span></li></ul></div>

# One Hot Encoding 
for Nominal categorical feature- variables with many categories

## normal One Hot Encoding

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('Datafiles/titanic.csv',usecols=['Sex'])
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [3]:
pd.get_dummies(df,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [4]:
df=pd.read_csv('Datafiles/titanic.csv',usecols=['Embarked'])
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [5]:
df.dropna(inplace=True)
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1

## solution to variables with many categories
http://proceedings.mlr.press/v7/niculescu09/niculescu09.pdf In the winning solution of the KDD 2009 cup: "Winning the KDD Cup Orange Challenge with Ensemble

The Team suggested using 10 most frequent labels convert them into dummy variables using onehotencoding

How can we do that in python?http://proceedings.mlr.press/v7/niculescu09/niculescu09.pdf In the winning solution of the KDD 2009 cup: "Winning the KDD Cup Orange Challenge with Ensemble

The Team suggested using 10 most frequent labels convert them into dummy variables using onehotencoding

In [6]:
#https://www.kaggle.com/aditya1702/mercedes-benz-data-exploration/data
import pandas as pd
import numpy as np
df = pd.read_csv('Datafiles/mercedesbenz.csv', usecols=['X1', 'X2'])
df.head()

  X1  X2
0  v  at
1  t  av
2  w   n
3  t   n
4  v   n

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   X1      4209 non-null   object
 1   X2      4209 non-null   object
dtypes: object(2)
memory usage: 65.9+ KB

In [8]:
for col in df:
    print(df[col].unique())

['v' 't' 'w' 'b' 'r' 'l' 's' 'aa' 'c' 'a' 'e' 'h' 'z' 'j' 'o' 'u' 'p' 'n'
 'i' 'y' 'd' 'f' 'm' 'k' 'g' 'q' 'ab']
['at' 'av' 'n' 'e' 'as' 'aq' 'r' 'ai' 'ak' 'm' 'a' 'k' 'ae' 's' 'f' 'd'
 'ag' 'ay' 'ac' 'ap' 'g' 'i' 'aw' 'y' 'b' 'ao' 'al' 'h' 'x' 'au' 't' 'an'
 'z' 'ah' 'p' 'am' 'j' 'q' 'af' 'l' 'aa' 'c' 'o' 'ar']

In [9]:
# look at how many labels each variable has
for col in df.columns:
    print(col, ': ', len(df[col].unique()), ' labels')

X1 :  27  labels
X2 :  44  labels

In [10]:
# examine how many columns will obtain after one hot encoding these variables
# can observe that from with just 2 categorical features are getting 69 features with help of one hot encoding
pd.get_dummies(df, drop_first=True).shape

(4209, 69)

In [11]:
# find top 10 most frequent categories for variable X2
df.X2.value_counts().sort_values(ascending=False).head(20)

as    1659
ae     496
ai     415
m      367
ak     265
r      153
n      137
s       94
f       87
e       81
aq      63
ay      54
a       47
t       29
k       25
i       25
b       21
ao      20
ag      19
z       19
Name: X2, dtype: int64

In [12]:
# make a list with most frequent categories of variable
top_10_labels = [y for y in df.X2.value_counts().sort_values(ascending=False).head(10).index]
top_10_labels

['as', 'ae', 'ai', 'm', 'ak', 'r', 'n', 's', 'f', 'e']

In [13]:
# get whole set of dummy variables for all categorical variables
def one_hot_encoding_top_x(df, variable, top_x_labels):
    # function to create dummy variables for most frequent labels
    # can vary number of most frequent labels that encode
    for label in top_x_labels:
        df[variable+'_'+label] = np.where(df[variable]==label, 1, 0)  # 1 for all matching labels, 0 for nonmatching column

In [14]:
# read data again
df = pd.read_csv('Datafiles/mercedesbenz.csv', usecols=['X1', 'X2'])
print("before encoding ",df.shape)
# encode X2 into 10 most frequent categories
one_hot_encoding_top_x(df, 'X2', top_10_labels)
df.drop(['X2'],axis=1,inplace=True)
print("After encoding ",df.shape)
df.head()

before encoding  (4209, 2)
After encoding  (4209, 11)

  X1  X2_as  X2_ae  X2_ai  X2_m  X2_ak  X2_r  X2_n  X2_s  X2_f  X2_e
0  v      0      0      0     0      0     0     0     0     0     0
1  t      0      0      0     0      0     0     0     0     0     0
2  w      0      0      0     0      0     0     1     0     0     0
3  t      0      0      0     0      0     0     1     0     0     0
4  v      0      0      0     0      0     0     1     0     0     0

# Count or frequency encoding 
for Nominal categorical feature

```
Another way to refer to variables that have a multitude of categories, is to call them variables with high cardinality.
If we have categorical variables containing many multiple labels or high cardinality,then by using one hot encoding, we will expand the feature space dramatically.
One approach that is heavily used in Kaggle competitions, is to replace each label of the categorical variable by the count, this is the amount of times each label appears in the dataset. Or the frequency, this is the percentage of observations within that category. The 2 are equivalent
```

## Count or frequency encoding exp1

In [17]:
df1 = pd.read_csv('Datafiles/mercedesbenz.csv', usecols=['X1', 'X2'])
df1.head()

  X1  X2
0  v  at
1  t  av
2  w   n
3  t   n
4  v   n

In [23]:
# have a look at how many labels
for col in df1.columns:
    print(col, ': ', len(df1[col].unique()), ' labels')

X1 :  27  labels
X2 :  44  labels

In [25]:
# obtain counts for each one of labels in variable X2
# capture this in a dictionary that can use to re-map labels
df1.X2.value_counts().to_dict()

{'as': 1659,
 'ae': 496,
 'ai': 415,
 'm': 367,
 'ak': 265,
 'r': 153,
 'n': 137,
 's': 94,
 'f': 87,
 'e': 81,
 'aq': 63,
 'ay': 54,
 'a': 47,
 't': 29,
 'k': 25,
 'i': 25,
 'b': 21,
 'ao': 20,
 'ag': 19,
 'z': 19,
 'd': 18,
 'ac': 13,
 'g': 12,
 'ap': 11,
 'y': 11,
 'x': 10,
 'aw': 8,
 'at': 6,
 'h': 6,
 'al': 5,
 'an': 5,
 'q': 5,
 'av': 4,
 'ah': 4,
 'p': 4,
 'au': 3,
 'am': 1,
 'j': 1,
 'af': 1,
 'l': 1,
 'aa': 1,
 'c': 1,
 'o': 1,
 'ar': 1}

In [27]:
# And now let's replace each label in X2 by its count
# first we make a dictionary that maps each label to counts
df_frequency_map = df1.X2.value_counts().to_dict()

In [28]:
# and now replace X2 labels in dataset df1
df1.X2 = df1.X2.map(df_frequency_map)
df1.head()

  X1   X2
0  v    6
1  t    4
2  w  137
3  t  137
4  v  137

## Count or frequency encoding exp2

In [15]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [16]:
# changing column name
columns=[1,3,5,6,7,8,9,13]
train_set=train_set[columns]
train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [17]:
for feature in train_set.columns[:]:
    print(feature,":",len(train_set[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [20]:
country_map=train_set['Country'].value_counts().to_dict()
country_map

{29170: 29170,
 643: 643,
 583: 583,
 198: 198,
 137: 137,
 121: 121,
 114: 114,
 106: 106,
 100: 100,
 95: 95,
 90: 90,
 81: 81,
 80: 80,
 75: 75,
 73: 73,
 70: 70,
 67: 67,
 64: 64,
 62: 62,
 60: 60,
 59: 59,
 29: 58,
 51: 51,
 44: 44,
 43: 43,
 19: 38,
 37: 37,
 18: 36,
 34: 34,
 31: 31,
 28: 28,
 13: 26,
 24: 24,
 20: 20,
 16: 16,
 14: 14,
 12: 12,
 1: 1}

In [19]:
train_set['Country']=train_set['Country'].map(country_map)
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

#### Advantages
It is very simple to implement\
Does not increase feature dimensional space
#### Disadvantages
If some of the labels have the same count, then they will be replaced with the same count and they will loose some valuable information\
Adds somewhat arbitrary numbers, and therefore weights to the different labels, that may not be related to their predictive power\
Follow this thread in Kaggle for more information: https://www.kaggle.com/general/16927

# Ordinal numbering encoding or Label Encoding
Ordinal data is a categorical, statistical data type where the variables have natural, ordered categories and the distances between the categories is not known\
For example:\
Student's grade in an exam (A, B, C or Fail)\
Educational level, with the categories: Elementary school, High school, College graduate, PhD ranked from 1 to 4\
When the categorical variables are ordinal, the most straightforward best approach is to replace the labels by some ordinal number based on the ranks

In [31]:
# create a variable with dates and from that extract the weekday
# create a list of dates with 20 days difference from today
# and then transform it into a datafame
import datetime
df_base = datetime.datetime.today()
df_date_list = [df_base - datetime.timedelta(days=x) for x in range(0, 20)]
df = pd.DataFrame(df_date_list)
df.columns = ['day']
df.head()

                         day
0 2022-12-20 20:03:26.678200
1 2022-12-19 20:03:26.678200
2 2022-12-18 20:03:26.678200
3 2022-12-17 20:03:26.678200
4 2022-12-16 20:03:26.678200

In [36]:
# extract week day name
df['day_of_week'] = df['day'].dt.day_name()
df.head()

                         day day_of_week
0 2022-12-20 20:03:26.678200     Tuesday
1 2022-12-19 20:03:26.678200      Monday
2 2022-12-18 20:03:26.678200      Sunday
3 2022-12-17 20:03:26.678200    Saturday
4 2022-12-16 20:03:26.678200      Friday

In [37]:
# Engineer categorical variable by ordinal number replacement
weekday_map = {'Monday':1,
               'Tuesday':2,
               'Wednesday':3,
               'Thursday':4,
               'Friday':5,
               'Saturday':6,
               'Sunday':7
}
df['day_ordinal'] = df.day_of_week.map(weekday_map)
df.head(5)

                         day day_of_week  day_ordinal
0 2022-12-20 20:03:26.678200     Tuesday            2
1 2022-12-19 20:03:26.678200      Monday            1
2 2022-12-18 20:03:26.678200      Sunday            7
3 2022-12-17 20:03:26.678200    Saturday            6
4 2022-12-16 20:03:26.678200      Friday            5

```
Ordinal Measurement Advantages
Ordinal measurement is normally used for surveys and questionnaires. Statistical analysis is applied to the responses once they are collected to place the people who took the survey into the various categories. The data is then compared to draw inferences and conclusions about the whole surveyed population with regard to the specific variables. The advantage of using ordinal measurement is ease of collation and categorization. If you ask a survey question without providing the variables, the answers are likely to be so diverse they cannot be converted to statistics.
With Respect to Machine Learning Keeps the semantical information of the variable (human readable content) and Straightforward

Ordinal Measurement Disadvantages
The same characteristics of ordinal measurement that create its advantages also create certain disadvantages. The responses are often so narrow in relation to the question that they create or magnify bias that is not factored into the survey. For example, on the question about satisfaction with the governor, people might be satisfied with his job performance but upset about a recent sex scandal. The survey question might lead respondents to state their dissatisfaction about the scandal, in spite of satisfaction with his job performance -- but the statistical conclusion will not differentiate.

With Respect to Machine Learning Does not add machine learning valuable information
```

# Target Guided Ordinal Encoding
Ordering the labels according to the target

Replace the labels by the joint probability of being 1 or 0

In [21]:
df=pd.read_csv('Datafiles/titanic.csv', usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [22]:
df['Cabin'].fillna('Missing',inplace=True)

In [23]:
# taking only capital letter of cabin name
df['Cabin'].astype(str).str[0]

0      M
1      C
2      M
3      C
4      M
      ..
886    M
887    B
888    M
889    C
890    M
Name: Cabin, Length: 891, dtype: object

In [24]:
df['Cabin']=df['Cabin'].astype(str).str[0]
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [25]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [27]:
# group by cabin based on target column Survived
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [29]:
# creating rank based on cabin
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [30]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [31]:
df['Cabin']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived  Cabin
0         0      1
1         1      4
2         1      1
3         1      4
4         0      1

# Mean Encoding
using mean value only to encode

In [37]:
df=pd.read_csv('Datafiles/titanic.csv', usecols=['Cabin','Survived'])
df['Cabin'].fillna('Missing',inplace=True)
df['Cabin'].astype(str).str[0]
df['Cabin']=df['Cabin'].astype(str).str[0]
mean_ordinal = round(df.groupby(['Cabin'])['Survived'].mean(), 4).to_dict()
mean_ordinal

{'A': 0.4667,
 'B': 0.7447,
 'C': 0.5932,
 'D': 0.7576,
 'E': 0.75,
 'F': 0.6154,
 'G': 0.5,
 'M': 0.2999,
 'T': 0.0}

In [38]:
df['Cabin']=df['Cabin'].map(mean_ordinal)
df.head()

   Survived   Cabin
0         0  0.2999
1         1  0.5932
2         1  0.2999
3         1  0.5932
4         0  0.2999

# Probability Ratio Encoding
1. Probability of Survived based on Cabin--- Categorical Feature
2. Probability of Not Survived---1-pr(Survived)
3. pr(Survived)/pr(Not Survived)
4. Dictonary to map cabin with probability
5. replace with the categorical feature

In [39]:
df=pd.read_csv('Datafiles/titanic.csv',usecols=['Cabin','Survived'])
df['Cabin'].fillna('Missing',inplace=True)
df['Cabin'].unique()

array(['Missing', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [40]:
df['Cabin']=df['Cabin'].astype(str).str[0]
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [41]:
prob_df=df.groupby(['Cabin'])['Survived'].mean()
prob_df=pd.DataFrame(prob_df)
prob_df

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [42]:
prob_df['Died']=1-prob_df['Survived']
prob_df.head()

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000

In [43]:
prob_df['Probability_ratio']=prob_df['Survived']/prob_df['Died']
prob_df.head()

       Survived      Died  Probability_ratio
Cabin
A      0.466667  0.533333           0.875000
B      0.744681  0.255319           2.916667
C      0.593220  0.406780           1.458333
D      0.757576  0.242424           3.125000
E      0.750000  0.250000           3.000000

In [44]:
probability_encoded=prob_df['Probability_ratio'].to_dict()
df['Cabin']=df['Cabin'].map(probability_encoded)
df.head()

   Survived     Cabin
0         0  0.428274
1         1  1.458333
2         1  0.428274
3         1  1.458333
4         0  0.428274